Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum
The ways to locate the crossing bars.

Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum.LOCATION_TYPE_UNDEFINED
The undefined location type.

Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum.LOCATION_TYPE_ABOVE
The location of the crossing bars is above the longitudinal bars.

Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum.LOCATION_TYPE_BELOW
The location of the crossing bars is below the longitudinal bars.